twitter-for-zombies/app/views/zombies/show.html.erb


<% @zombie.tweets.each do |tweet| %>
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`zombie_id` = 1