forum/app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT `topics`.* FROM `topics`

  def show
    @topic = Topic.find(params[:id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1

  def edit
    @topic = Topic.find(params[:id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 2 LIMIT 1

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`created_at`, `posted_on`, `poster_id`, `title`, `updated_at`, `user_id`) VALUES ('2012-09-08 21:53:36', '2012-09-08 21:53:00', 1, 'Third topic', '2012-09-08 21:53:36', NULL)

  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 3 LIMIT 1
DELETE FROM `topics` WHERE `topics`.`id` = 3